Revit 2027 API
FabricationService.FabricationSystemName Property
 The fabrication system name of the service.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string FabricationSystemName { get; }
Public ReadOnly Property FabricationSystemName As String
	Get
public:
property String^ FabricationSystemName {
	String^ get ();
}
member FabricationSystemName : string with get
Property Value
String
Remarks
 A fabrication system in this context is a set of buttons that can be shared across fabrication services. It has nothing to do with other MEP systems in Revit.
See Also
Reference
FabricationService Class
Autodesk.Revit.DB Namespace